thread.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2020-03-15 Sun 10:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linux线程之一</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy">
<link rel="stylesheet" href="./org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Linux线程之一</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc56c6a3">1. 介绍</a></li>
<li><a href="#org8ab16ff">2. 基础概念</a></li>
<li><a href="#org04221c8">3. API</a></li>
<li><a href="#org3154763">4. 线程同步</a></li>
</ul>
</div>
</div>
<p>
本文是讲述Linux线程系列文章的第一篇。
</p>

<div id="outline-container-orgc56c6a3" class="outline-2">
<h2 id="orgc56c6a3"><span class="section-number-2">1</span> 介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
在单个进程的环境里可以利用线程去执行多个任务，在单个进程的环境里，这些线程共享许多资源，包
括文件描述符以及内存。本文先讲述一些线程的基本概念，然后是一些API介绍以及示例用法，有些程
序被故意写的“不完美”，以使读者深刻线程中的种种陷阱。一旦涉及“共享”就存在同步与竞争问题，本
文以线程同步结束，这是使用线程编程的一个最头疼的问题。
</p>
</div>
</div>
<div id="outline-container-org8ab16ff" class="outline-2">
<h2 id="org8ab16ff"><span class="section-number-2">2</span> 基础概念</h2>
<div class="outline-text-2" id="text-2">
<p>
传统的进程通常都是单线程的，使用多线程可以做到同时（单处理器不是严格的同时）处理多个任务。
这主要有以下几个优点：
</p>
<ul class="org-ul">
<li>分开任务到另一个线程去可以使得编程模型成为同步模型，这比异步编程模型更简单。</li>
<li>操作系统提供了进程间的共享机制，但这个机制比较复杂。所有线程共享进程的地址空间，这使得线
程间的资源贡献变得简单。</li>
<li>线程是操作系统调度的最小单元，多线程意味着当某个线程无事可做时，程序中的另外部分（其它线
程）仍旧有机会得到操作系统的调度。挖掘程序中的并行性，多线程可以显著提高程序的吞吐量。</li>
<li>多线程还可以用来改善程序的响应时间。假如一个程序的计算时间较长，如果使用单线程，会使得程
序长期卡在计算部分，对于用户交互的程序来说，这是不可接受的，人类的耐心通常非常有限，而把
交互部分独立成线程可以缓解这个问题。</li>
</ul>

<p>
某些人把多线程与多处理器（核）等同起来，认为只有多核系统才能充分利用多线程。这实际上是有
一定误解的。要理解多线程的本质： <b>将原本以单线程运行的程序，划分几部分出来后创建新的线程去执行。</b> 这种做法增加了操作系统调度到本程序的机会。即使有线程当前被阻塞了，也会有其它线程
被调度到继续执行。这样仍旧可以改善响应时间以及吞吐量， <b>只要程序中存在并行性或有阻塞部分都可以尝试多线程。</b>
</p>

<p>
一个线程代表了一个执行环境。一个线程ID来代表哪个线程、寄存器值、栈、调度优先级与策略、
errno以及信号。在进程里的一切所有线程都是共享的，比如程序的代码段、全局与堆内存以及文件描述
符。
</p>
</div>
</div>
<div id="outline-container-org04221c8" class="outline-2">
<h2 id="org04221c8"><span class="section-number-2">3</span> API</h2>
<div class="outline-text-2" id="text-3">
<p>
接下来介绍用于操纵线程的POSIX标准API。这些API可以用宏 \<sub>POSIX</sub>\<sub>THREADS以</sub>#ifdef的形式来测试是
否支持POSIX的线程相关的API，也可以调用sysconf在运行时来检测。
</p>
</div>
</div>

<div id="outline-container-org3154763" class="outline-2">
<h2 id="org3154763"><span class="section-number-2">4</span> 线程同步</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy</p>
<p class="date">Created: 2020-03-15 Sun 10:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
